<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of DraftSight and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.apeelsciences.recipes.munki.DraftSight</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>DraftSight</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>Apeel</string>
			</array>
			<key>description</key>
			<string>Access existing DWG files and create new ones at a fraction of the cost of alternative CAD products. A familiar user interface and a minimal learning curve facilitates an easy transition from your current CAD application </string>
			<key>developer</key>
			<string>3ds</string>
			<key>category</key>
			<string>CAD</string>
			<key>display_name</key>
			<string>DraftSight</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.apeelsciences.recipes.download.DraftSight</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>