<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates a munki package, imports it into the AirWatch Admin console.</string>
    <key>Identifier</key>
    <string>com.apeelsciences.airwatch.OhausRecorder</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OhausRecorder</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.apeelsciences.recipes.munki.OhausRecorder</string>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.jprichards.AirWatchImporter/AirWatchImporter</string>
            <key>Arguments</key>
            <dict>
                <key>munki_repo_path</key>
                <string>/Volumes/munki_repo</string>
                <key>airwatch_url</key>
                <string>AIRWATCH_URL</string>
                <key>airwatch_groupid</key>
                <string>GROUP_ID</string>
                <key>api_token</key>
                <string>##################################</string>
                <key>api_username</key>
                <string>USERNAME@DOMAIN.COM</string>
                <key>api_password</key>
                <string>PASSWORD</string>
                <key>smart_group_name</key>
                <string>SMARTGROUP</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>